Homework/xxxx/xxxx-bare/src/main/resources/wsdl/person_service.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.5 git-revision#7ddc91f. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.5 git-revision#7ddc91f. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://service/" name="PersonServiceWrapped">
<import namespace="http://template/" location="http://localhost:8080/PersonSoapWrapped/service?wsdl=1"/>
<binding xmlns:ns1="http://template/" name="PersonServicePortBinding" type="ns1:PersonServiceTemplate">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="GetPerson">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="GeneralError">
<soap:fault name="GeneralError" use="literal"/>
</fault>
<fault name="AccessForbidden">
<soap:fault name="AccessForbidden" use="literal"/>
</fault>
<fault name="PersonNotFound">
<soap:fault name="PersonNotFound" use="literal"/>
</fault>
</operation>
<operation name="ListPersons">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="GeneralError">
<soap:fault name="GeneralError" use="literal"/>
</fault>
<fault name="AccessForbidden">
<soap:fault name="AccessForbidden" use="literal"/>
</fault>
</operation>
<operation name="AddPerson">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="GeneralError">
<soap:fault name="GeneralError" use="literal"/>
</fault>
<fault name="AccessForbidden">
<soap:fault name="AccessForbidden" use="literal"/>
</fault>
<fault name="PersonAlreadyExists">
<soap:fault name="PersonAlreadyExists" use="literal"/>
</fault>
</operation>
<operation name="UpdatePerson">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="GeneralError">
<soap:fault name="GeneralError" use="literal"/>
</fault>
<fault name="AccessForbidden">
<soap:fault name="AccessForbidden" use="literal"/>
</fault>
<fault name="PersonNotFound">
<soap:fault name="PersonNotFound" use="literal"/>
</fault>
</operation>
<operation name="DeletePerson">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="GeneralError">
<soap:fault name="GeneralError" use="literal"/>
</fault>
<fault name="AccessForbidden">
<soap:fault name="AccessForbidden" use="literal"/>
</fault>
<fault name="PersonNotFound">
<soap:fault name="PersonNotFound" use="literal"/>
</fault>
</operation>
</binding>
<service name="PersonServiceWrapped">
<port name="PersonServicePort" binding="tns:PersonServicePortBinding">
<soap:address location="http://localhost:8080/PersonSoapWrapped/service"/>
</port>
</service>
</definitions>