Homework/xxxx/xxxx-wrapped/logs/client_trace.log

2022-10-17 22:11:51.0905 TRACE 1 person_wrapped_client 86a953eb-7871-4b36-bc56-9bc208576912 methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:GetPerson xmlns:ns2="http://template/">
      <id>1</id>
    </ns2:GetPerson>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:52.0519 TRACE 1 person_wrapped_client 99fe2db5-d676-4698-bd8a-3424c0ef10f2 methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:GetPersonResponse xmlns:ns2="http://template/">
      <person id="1">
        <first-name>Peter</first-name>
        <last-name>Parker</last-name>
        <age>24</age>
      </person>
    </ns2:GetPersonResponse>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:52.0563 TRACE 1 person_wrapped_client bba1369b-da83-407a-b6c5-07ff9173dc47 methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:GetPerson xmlns:ns2="http://template/">
      <id>0</id>
    </ns2:GetPerson>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:52.0731 TRACE 1 person_wrapped_client b43b1555-136f-4801-82a2-47e5f3f3af9f methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <S:Fault xmlns:ns3="http://www.w3.org/2003/05/soap-envelope">
      <faultcode>S:Server</faultcode>
      <faultstring>No person found with id 0</faultstring>
      <detail>
        <ns2:PersonNotFound xmlns:ns2="http://template/">
          <message>No person found with id 0</message>
        </ns2:PersonNotFound>
      </detail>
    </S:Fault>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:52.0790 ERROR 1 person_wrapped_client b43b1555-136f-4801-82a2-47e5f3f3af9f methodName=getPerson {{{ No person found with id 0 }}}
2022-10-17 22:11:52.0800 TRACE 1 person_wrapped_client d65afa5b-b202-4b86-9ff6-c7ebf3e8d129 methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:AddPerson xmlns:ns2="http://template/">
      <id>11</id>
      <first-name>John</first-name>
      <last-name>Doe</last-name>
      <age>24</age>
    </ns2:AddPerson>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:52.0931 TRACE 1 person_wrapped_client b6286073-1ba0-405a-90c5-af3bbb232f76 methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:AddPersonResponse xmlns:ns2="http://template/">
      <AddPersonResult>true</AddPersonResult>
    </ns2:AddPersonResponse>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:52.0939 TRACE 1 person_wrapped_client 9ad8616d-28da-4c59-bb19-9889088044da methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:AddPerson xmlns:ns2="http://template/">
      <id>1</id>
      <first-name>Jane</first-name>
      <last-name>Doe</last-name>
      <age>21</age>
    </ns2:AddPerson>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0027 TRACE 1 person_wrapped_client e091fcfc-038e-4b01-a2ab-ba78e42c271f methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <S:Fault xmlns:ns3="http://www.w3.org/2003/05/soap-envelope">
      <faultcode>S:Server</faultcode>
      <faultstring>Person already exists in database</faultstring>
      <detail>
        <ns2:PersonAlreadyExists xmlns:ns2="http://template/">
          <message>Person already exists in database</message>
        </ns2:PersonAlreadyExists>
      </detail>
    </S:Fault>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0031 ERROR 1 person_wrapped_client e091fcfc-038e-4b01-a2ab-ba78e42c271f methodName=addPerson {{{ Person already exists in database }}}
2022-10-17 22:11:53.0043 TRACE 1 person_wrapped_client 26d5e719-9122-495d-b2fb-9a704cfc05df methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:UpdatePerson xmlns:ns2="http://template/">
      <id>11</id>
      <first-name>Jane</first-name>
      <last-name>Doe</last-name>
      <age>21</age>
    </ns2:UpdatePerson>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0220 TRACE 1 person_wrapped_client 6d13c75a-2b63-455d-b7d2-8c83e15c5084 methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:UpdatePersonResponse xmlns:ns2="http://template/">
      <UpdatePersonResult>true</UpdatePersonResult>
    </ns2:UpdatePersonResponse>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0227 TRACE 1 person_wrapped_client 654533bc-b561-4aa5-a77f-804e8a94b1f3 methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:UpdatePerson xmlns:ns2="http://template/">
      <id>0</id>
      <first-name>Jane</first-name>
      <last-name>Doe</last-name>
      <age>21</age>
    </ns2:UpdatePerson>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0259 TRACE 1 person_wrapped_client 2f20b000-98e1-4c9b-8d42-124048949108 methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <S:Fault xmlns:ns3="http://www.w3.org/2003/05/soap-envelope">
      <faultcode>S:Server</faultcode>
      <faultstring>No person matches given id</faultstring>
      <detail>
        <ns2:PersonNotFound xmlns:ns2="http://template/">
          <message>No person matches given id</message>
        </ns2:PersonNotFound>
      </detail>
    </S:Fault>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0261 ERROR 1 person_wrapped_client 2f20b000-98e1-4c9b-8d42-124048949108 methodName=updatePerson {{{ No person matches given id }}}
2022-10-17 22:11:53.0266 TRACE 1 person_wrapped_client ba654322-2e62-4544-8b7c-73f32b053d39 methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:DeletePerson xmlns:ns2="http://template/">
      <id>11</id>
    </ns2:DeletePerson>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0410 TRACE 1 person_wrapped_client 9b7083ca-c1d7-40f4-a68d-670add608c24 methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:DeletePersonResponse xmlns:ns2="http://template/">
      <DeletePersonResult>true</DeletePersonResult>
    </ns2:DeletePersonResponse>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0448 TRACE 1 person_wrapped_client 42fd4a51-5a30-48be-8141-462f1b452154 methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:DeletePerson xmlns:ns2="http://template/">
      <id>0</id>
    </ns2:DeletePerson>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0542 TRACE 1 person_wrapped_client b50d7531-ea67-459e-a667-d0b494c3ba66 methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <S:Fault xmlns:ns3="http://www.w3.org/2003/05/soap-envelope">
      <faultcode>S:Server</faultcode>
      <faultstring>No person with id 0 found in database</faultstring>
      <detail>
        <ns2:PersonNotFound xmlns:ns2="http://template/">
          <message>No person with id 0 found in database</message>
        </ns2:PersonNotFound>
      </detail>
    </S:Fault>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0545 ERROR 1 person_wrapped_client b50d7531-ea67-459e-a667-d0b494c3ba66 methodName=deletePerson {{{ No person with id 0 found in database }}}
2022-10-17 22:11:53.0552 TRACE 1 person_wrapped_client bedfa790-431e-447a-960a-47eb7ec5f471 methodName=handleMessage {{{ SOAP request: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPersons xmlns:ns2="http://template/"/>
  </S:Body>
</S:Envelope>
 }}}
2022-10-17 22:11:53.0710 TRACE 1 person_wrapped_client 4b4556d1-8260-4fa1-8b9c-5d0c8bb57af3 methodName=handleMessage {{{ SOAP response: 
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <S:Body>
    <ns2:ListPersonsResponse xmlns:ns2="http://template/">
      <ListPersonsResult>
        <person id="1">
          <first-name>Peter</first-name>
          <last-name>Parker</last-name>
          <age>24</age>
        </person>
        <person id="2">
          <first-name>Miles</first-name>
          <last-name>Morales</last-name>
          <age>17</age>
        </person>
        <person id="3">
          <first-name>Martin</first-name>
          <last-name>Li</last-name>
          <age>40</age>
        </person>
        <person id="4">
          <first-name>Wilson</first-name>
          <last-name>Fisk</last-name>
          <age>48</age>
        </person>
        <person id="5">
          <first-name>Otto</first-name>
          <last-name>Octavius</last-name>
          <age>63</age>
        </person>
        <person id="6">
          <first-name>Nathan</first-name>
          <last-name>Drake</last-name>
          <age>38</age>
        </person>
        <person id="7">
          <first-name>Mae</first-name>
          <last-name>Borowski</last-name>
          <age>20</age>
        </person>
        <person id="8">
          <first-name>Edith</first-name>
          <last-name>Finch</last-name>
          <age>17</age>
        </person>
        <person id="9">
          <first-name>Leon</first-name>
          <last-name>Kennedy</last-name>
          <age>21</age>
        </person>
        <person id="10">
          <first-name>Hank</first-name>
          <last-name>Anderson</last-name>
          <age>53</age>
        </person>
      </ListPersonsResult>
    </ns2:ListPersonsResponse>
  </S:Body>
</S:Envelope>
 }}}
